conformance/mega-backend/generated/determine-journey-warnings-structure.mmd
flowchart LR
    n1(["Start"])
    n2["warnings"]
    n3{"select applicable decision rule"}
    n4["invalid journey rule"]
    n5["evaluate is journey"]
    n6{"task equals reisen"}
    n7["derive grouped project time entries"]
    n8["warnings"]
    n9["journey direction"]
    n10{"a following entry exists"}
    n11["evaluate try to get next journey direction"]
    n12{"a following entry exists"}
    n13["use journey time entries following entry journey direction"]
    n14["use absent"]
    n15["derive next direction as try to get next journey direction grouped project time entries"]
    n16["evaluate journey direction"]
    n17{"choose by current direction"}
    n18{"former direction equals to"}
    n19{"former direction equals further"}
    n20["set warning to back missing"]
    n21["set former direction to current direction"]
    n22{"former direction is absent"}
    n23{"former direction equals back"}
    n24["set warning to to missing"]
    n25{"former direction exists"}
    n26["set former direction to current direction"]
    n27["decision cannot continue"]
    n28["evaluate is finished"]
    n29{"former direction exists"}
    n30{"former direction equals back"}
    n31["evaluate is starting new journey"]
    n32{"warning is absent"}
    n33{"is not finished"}
    n34{"next direction is absent"}
    n35{"is starting new journey next direction"}
    n36["set former direction to absent"]
    n37["derive warning"]
    n38{"warning exists"}
    n39["create journey warning"]
    n40["journey warning"]
    n41["set journey warning date"]
    n42["evaluate add"]
    n43["evaluate add"]
    n44["invalid working location in journey rule"]
    n45["derive sorted project entries"]
    n46["warnings"]
    n47["evaluate has journey entries"]
    n48["evaluate is task"]
    n49["evaluate is journey"]
    n50{"task equals reisen"}
    n51{"is not journey task"}
    n52{"does not have journey entries sorted project entries"}
    n53{"for each project entry in sorted project entries"}
    n54["evaluate is journey"]
    n55{"task equals reisen"}
    n56{"task is journey project entry task"}
    n57["derive journey direction"]
    n58{"journey direction equals back"}
    n59["set working location to main"]
    n60{"journey direction equals to"}
    n61{"journey direction equals further"}
    n62["set working location to project entry working location"]
    n63{"project entry working location does not equal working location"}
    n64["create journey warning"]
    n65["journey warning"]
    n66["set journey warning date"]
    n67["evaluate add"]
    n68["evaluate add"]
    n69["location relevant set journey rule"]
    n70["warnings"]
    n71{"for each project entry in project entries"}
    n72{"project entry work location is project relevant"}
    n73{"none of warnings match item date equals project entry date"}
    n74["create journey warning"]
    n75["journey warning"]
    n76["set journey warning date"]
    n77["evaluate add"]
    n78["evaluate add"]
    n79["derive calculated warnings"]
    n80["evaluate add to journey warnings"]
    n81["evaluate text for warning type"]
    n82["evaluate message template"]
    n83{"select applicable decision rule"}
    n84["journey warning type rule"]
    n85["time warning type rule"]
    n86{"select applicable decision rule"}
    n87["journey warning type rule"]
    n88["time warning type rule"]
    n89["evaluate add"]
    n90["derive journey warning"]
    n91{"journey warning is present"}
    n92["evaluate add all"]
    n93["evaluate add all"]
    n94["evaluate add"]
    n95["evaluate sort"]
    n96(["Stop"])
    n1 -->|"next"| n2
    n2 -->|"next"| n3
    n3 -->|"selected rule"| n4
    n4 -->|"next"| n5
    n5 -->|"next"| n6
    n6 -->|"true"| n7
    n6 -->|"false"| n7
    n7 -->|"next"| n8
    n8 -->|"next"| n9
    n9 -->|"next"| n10
    n10 -->|"yes"| n11
    n11 -->|"next"| n12
    n12 -->|"true"| n13
    n12 -->|"false"| n14
    n13 -->|"result"| n15
    n14 -->|"result"| n15
    n15 -->|"next"| n16
    n16 -->|"next"| n17
    n18 -->|"false"| n19
    n17 -->|"to"| n18
    n18 -->|"true"| n20
    n19 -->|"true"| n20
    n20 -->|"next"| n21
    n19 -->|"false"| n21
    n22 -->|"false"| n23
    n17 -->|"further or back"| n22
    n22 -->|"true"| n24
    n23 -->|"true"| n24
    n24 -->|"next"| n25
    n23 -->|"false"| n25
    n25 -->|"true"| n26
    n17 -->|"default"| n27
    n21 -->|"next"| n28
    n26 -->|"next"| n28
    n25 -->|"false"| n28
    n29 -->|"true"| n30
    n28 -->|"next"| n29
    n30 -->|"true"| n31
    n29 -->|"false"| n31
    n30 -->|"false"| n31
    n32 -->|"true"| n33
    n34 -->|"false"| n35
    n33 -->|"true"| n34
    n31 -->|"result"| n32
    n34 -->|"true"| n36
    n35 -->|"true"| n36
    n36 -->|"result"| n37
    n32 -->|"false"| n37
    n33 -->|"false"| n37
    n35 -->|"false"| n37
    n37 -->|"next"| n38
    n38 -->|"true"| n39
    n39 -->|"next"| n40
    n40 -->|"next"| n41
    n41 -->|"next"| n42
    n42 -->|"result"| n43
    n43 -->|"next entry"| n10
    n38 -->|"next entry"| n10
    n3 -->|"selected rule"| n44
    n44 -->|"next"| n45
    n45 -->|"next"| n46
    n46 -->|"next"| n47
    n47 -->|"next"| n48
    n48 -->|"next"| n49
    n49 -->|"next"| n50
    n50 -->|"true"| n51
    n50 -->|"false"| n51
    n51 -->|"true"| n52
    n51 -->|"false"| n52
    n52 -->|"false"| n53
    n53 -->|"item"| n54
    n54 -->|"next"| n55
    n55 -->|"true"| n56
    n55 -->|"false"| n56
    n56 -->|"true"| n57
    n57 -->|"next"| n58
    n58 -->|"true"| n59
    n60 -->|"false"| n61
    n59 -->|"next"| n60
    n58 -->|"false"| n60
    n60 -->|"true"| n62
    n61 -->|"true"| n62
    n62 -->|"next"| n63
    n61 -->|"false"| n63
    n56 -->|"false"| n63
    n63 -->|"true"| n64
    n64 -->|"next"| n65
    n65 -->|"next"| n66
    n66 -->|"next"| n67
    n67 -->|"result"| n68
    n68 -->|"next item"| n53
    n63 -->|"next item"| n53
    n3 -->|"selected rule"| n69
    n69 -->|"next"| n70
    n70 -->|"next"| n71
    n72 -->|"true"| n73
    n71 -->|"item"| n72
    n73 -->|"true"| n74
    n74 -->|"next"| n75
    n75 -->|"next"| n76
    n76 -->|"next"| n77
    n77 -->|"result"| n78
    n78 -->|"next item"| n71
    n72 -->|"next item"| n71
    n73 -->|"next item"| n71
    n10 -->|"no"| n79
    n52 -->|"true"| n79
    n53 -->|"done"| n79
    n71 -->|"done"| n79
    n79 -->|"next"| n80
    n80 -->|"next"| n81
    n81 -->|"next"| n82
    n82 -->|"next"| n83
    n83 -->|"selected rule"| n84
    n83 -->|"selected rule"| n85
    n84 -->|"result"| n86
    n85 -->|"result"| n86
    n86 -->|"selected rule"| n87
    n86 -->|"selected rule"| n88
    n87 -->|"result"| n89
    n88 -->|"result"| n89
    n89 -->|"next"| n90
    n90 -->|"next"| n91
    n91 -->|"true"| n92
    n92 -->|"next"| n93
    n91 -->|"false"| n94
    n93 -->|"next"| n95
    n94 -->|"next"| n95
    n27 -->|"fails"| n96
    n95 -->|"returns warnings"| n96
