conformance/mega-backend/generated/determine-journey-warnings-structure.puml
@startuml
title determine journey warnings
left to right direction
usecase "Start" as n1
rectangle "warnings" as n2
diamond "select applicable decision rule" as n3
rectangle "invalid journey rule" as n4
rectangle "evaluate is journey" as n5
diamond "task equals reisen" as n6
rectangle "derive grouped project time entries" as n7
rectangle "warnings" as n8
rectangle "journey direction" as n9
diamond "a following entry exists" as n10
rectangle "evaluate try to get next journey direction" as n11
diamond "a following entry exists" as n12
rectangle "use journey time entries following entry journey direction" as n13
rectangle "use absent" as n14
rectangle "derive next direction as try to get next journey direction grouped project time entries" as n15
rectangle "evaluate journey direction" as n16
diamond "choose by current direction" as n17
diamond "former direction equals to" as n18
diamond "former direction equals further" as n19
rectangle "set warning to back missing" as n20
rectangle "set former direction to current direction" as n21
diamond "former direction is absent" as n22
diamond "former direction equals back" as n23
rectangle "set warning to to missing" as n24
diamond "former direction exists" as n25
rectangle "set former direction to current direction" as n26
rectangle "decision cannot continue" as n27
rectangle "evaluate is finished" as n28
diamond "former direction exists" as n29
diamond "former direction equals back" as n30
rectangle "evaluate is starting new journey" as n31
diamond "warning is absent" as n32
diamond "is not finished" as n33
diamond "next direction is absent" as n34
diamond "is starting new journey next direction" as n35
rectangle "set former direction to absent" as n36
rectangle "derive warning" as n37
diamond "warning exists" as n38
rectangle "create journey warning" as n39
rectangle "journey warning" as n40
rectangle "set journey warning date" as n41
rectangle "evaluate add" as n42
rectangle "evaluate add" as n43
rectangle "invalid working location in journey rule" as n44
rectangle "derive sorted project entries" as n45
rectangle "warnings" as n46
rectangle "evaluate has journey entries" as n47
rectangle "evaluate is task" as n48
rectangle "evaluate is journey" as n49
diamond "task equals reisen" as n50
diamond "is not journey task" as n51
diamond "does not have journey entries sorted project entries" as n52
diamond "for each project entry in sorted project entries" as n53
rectangle "evaluate is journey" as n54
diamond "task equals reisen" as n55
diamond "task is journey project entry task" as n56
rectangle "derive journey direction" as n57
diamond "journey direction equals back" as n58
rectangle "set working location to main" as n59
diamond "journey direction equals to" as n60
diamond "journey direction equals further" as n61
rectangle "set working location to project entry working location" as n62
diamond "project entry working location does not equal working location" as n63
rectangle "create journey warning" as n64
rectangle "journey warning" as n65
rectangle "set journey warning date" as n66
rectangle "evaluate add" as n67
rectangle "evaluate add" as n68
rectangle "location relevant set journey rule" as n69
rectangle "warnings" as n70
diamond "for each project entry in project entries" as n71
diamond "project entry work location is project relevant" as n72
diamond "none of warnings match item date equals project entry date" as n73
rectangle "create journey warning" as n74
rectangle "journey warning" as n75
rectangle "set journey warning date" as n76
rectangle "evaluate add" as n77
rectangle "evaluate add" as n78
rectangle "derive calculated warnings" as n79
rectangle "evaluate add to journey warnings" as n80
rectangle "evaluate text for warning type" as n81
rectangle "evaluate message template" as n82
diamond "select applicable decision rule" as n83
rectangle "journey warning type rule" as n84
rectangle "time warning type rule" as n85
diamond "select applicable decision rule" as n86
rectangle "journey warning type rule" as n87
rectangle "time warning type rule" as n88
rectangle "evaluate add" as n89
rectangle "derive journey warning" as n90
diamond "journey warning is present" as n91
rectangle "evaluate add all" as n92
rectangle "evaluate add all" as n93
rectangle "evaluate add" as n94
rectangle "evaluate sort" as n95
usecase "Stop" as n96
n1 --> n2 : next
n2 --> n3 : next
n3 --> n4 : selected rule
n4 --> n5 : next
n5 --> n6 : next
n6 --> n7 : true
n6 --> n7 : false
n7 --> n8 : next
n8 --> n9 : next
n9 --> n10 : next
n10 --> n11 : yes
n11 --> n12 : next
n12 --> n13 : true
n12 --> n14 : false
n13 --> n15 : result
n14 --> n15 : result
n15 --> n16 : next
n16 --> n17 : next
n18 --> n19 : false
n17 --> n18 : to
n18 --> n20 : true
n19 --> n20 : true
n20 --> n21 : next
n19 --> n21 : false
n22 --> n23 : false
n17 --> n22 : further or back
n22 --> n24 : true
n23 --> n24 : true
n24 --> n25 : next
n23 --> n25 : false
n25 --> n26 : true
n17 --> n27 : default
n21 --> n28 : next
n26 --> n28 : next
n25 --> n28 : false
n29 --> n30 : true
n28 --> n29 : next
n30 --> n31 : true
n29 --> n31 : false
n30 --> n31 : false
n32 --> n33 : true
n34 --> n35 : false
n33 --> n34 : true
n31 --> n32 : result
n34 --> n36 : true
n35 --> n36 : true
n36 --> n37 : result
n32 --> n37 : false
n33 --> n37 : false
n35 --> n37 : false
n37 --> n38 : next
n38 --> n39 : true
n39 --> n40 : next
n40 --> n41 : next
n41 --> n42 : next
n42 --> n43 : result
n43 --> n10 : next entry
n38 --> n10 : next entry
n3 --> n44 : selected rule
n44 --> n45 : next
n45 --> n46 : next
n46 --> n47 : next
n47 --> n48 : next
n48 --> n49 : next
n49 --> n50 : next
n50 --> n51 : true
n50 --> n51 : false
n51 --> n52 : true
n51 --> n52 : false
n52 --> n53 : false
n53 --> n54 : item
n54 --> n55 : next
n55 --> n56 : true
n55 --> n56 : false
n56 --> n57 : true
n57 --> n58 : next
n58 --> n59 : true
n60 --> n61 : false
n59 --> n60 : next
n58 --> n60 : false
n60 --> n62 : true
n61 --> n62 : true
n62 --> n63 : next
n61 --> n63 : false
n56 --> n63 : false
n63 --> n64 : true
n64 --> n65 : next
n65 --> n66 : next
n66 --> n67 : next
n67 --> n68 : result
n68 --> n53 : next item
n63 --> n53 : next item
n3 --> n69 : selected rule
n69 --> n70 : next
n70 --> n71 : next
n72 --> n73 : true
n71 --> n72 : item
n73 --> n74 : true
n74 --> n75 : next
n75 --> n76 : next
n76 --> n77 : next
n77 --> n78 : result
n78 --> n71 : next item
n72 --> n71 : next item
n73 --> n71 : next item
n10 --> n79 : no
n52 --> n79 : true
n53 --> n79 : done
n71 --> n79 : done
n79 --> n80 : next
n80 --> n81 : next
n81 --> n82 : next
n82 --> n83 : next
n83 --> n84 : selected rule
n83 --> n85 : selected rule
n84 --> n86 : result
n85 --> n86 : result
n86 --> n87 : selected rule
n86 --> n88 : selected rule
n87 --> n89 : result
n88 --> n89 : result
n89 --> n90 : next
n90 --> n91 : next
n91 --> n92 : true
n92 --> n93 : next
n91 --> n94 : false
n93 --> n95 : next
n94 --> n95 : next
n27 --> n96 : fails
n95 --> n96 : returns warnings
@enduml
